src/bsl/InformationRegisters/гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыОбъектовWarehouse</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиКачестваWarehouse</v8:Type>
						<v8:Type>cfg:CatalogRef.гкс_ПродукцияWarehouse</v8:Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ОчередьОбработкиВходящихДанныхWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ОчередьОбработкиВходящихДанныхWarehouse</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоНеудачныхОбработок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОбОшибкеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВходящиеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ВходящиеДанныеWarehouse</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ВнешниеПробы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ВнешниеПробы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ВходящиеДанныеWarehouse</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПробы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДКомпозитнойПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоИнспекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиКачестваWarehouse</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПродукцияWarehouse</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтанцияНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сюрвейер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Элеватор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыОбъектовWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыОбъектовWarehouse</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиницыИзмерения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Показатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтанцияНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтанцияОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сюрвейер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаПоказателиКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Элеватор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_НазначенияИспользованияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_НазначенияИспользованияКачества</Name>
			<Comment>ERP-2184</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаКомпозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлеваторВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛаборантВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпозитВнешниеПробыНаТысячуТон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточныйКомпозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйАнализ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Catalogs/гкс_ВходящиеДанныеWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_ВходящиеДанныеWarehouse</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПробы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДКомпозитнойПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоИнспекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТекстыСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.гкс_ТипыОбъектовWarehouse</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/CommonModules/гкс_ИнтеграцияWarehouse/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область РегламентныеЗадания

// Обработчик регламентного задания "гкс_ПолучениеДанныхWarehouse".
//
Процедура ПолучениеДанныхWarehouse() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.гкс_ПолучениеДанныхWarehouse);

	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСWarehouse") Тогда
		ВызватьИсключение НСтр("ru = 'Регламентное задание недоступно по функциональным опциям.'");
	КонецЕсли;

	ПолучитьДанныеWarehouse();

КонецПроцедуры

// Обработчик регламентного задания "гкс_ОбработкаВходящихДанныхWarehouse".
//
Процедура ОбработкаВходящихДанныхWarehouse() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.гкс_ОбработкаВходящихДанныхWarehouse);

	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСWarehouse") Тогда
		ВызватьИсключение НСтр("ru = 'Регламентное задание недоступно по функциональным опциям.'");
	КонецЕсли;

	ОбработатьВходящиеДанныеWarehouse();

КонецПроцедуры

// Добавляет команды Warehouse на форму объекта при создании на сервере.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, из которой вызвана процедура.
//   МестоРазмещенияКоманд - ГруппаФормы - место для размещения, по умолчанию - командная панель формы.
//   ПараметрыОповещения - Структура - параметры, где может быть установлен источник команды.
//
Процедура ПриСозданииНаСервере(Форма, МестоРазмещенияКоманд = Неопределено, ПараметрыОповещения = Неопределено) Экспорт

	Попытка
		Если ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСWarehouse") Тогда
			ДобавитьКомандуЗагрузить(Форма, МестоРазмещенияКоманд);
		КонецЕсли;
	Исключение
		ТекстСообщенияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстСообщенияОбОшибке);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке);
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.РегламентныеЗадания

// Определяет зависимости регламентных заданий и их дополнительные свойства.
//
// Параметры:
//  Настройки - ТаблицаЗначений:
//    * РегламентноеЗадание - ОбъектМетаданныхРегламентноеЗадание - регламентное задание.
//    * ФункциональнаяОпция - ОбъектМетаданныхФункциональнаяОпция - функциональная опция,
//        от которой зависит регламентное задание.
//    * ЗависимостьПоИ - Булево - если регламентное задание зависит более чем
//        от одной функциональной опции и его необходимо включать только тогда,
//        когда все функциональные опции включены, то следует указывать Истина
//        для каждой зависимости.
//        По умолчанию Ложь - если хотя бы одна функциональная опция включена,
//        то регламентное задание тоже включено.
//    * ВключатьПриВключенииФункциональнойОпции - Булево
//                                              - Неопределено - если Ложь, то при
//        включении функциональной опции регламентное задание не будет включаться. Значение
//        Неопределено соответствует значению Истина.
//        По умолчанию - Неопределено.
//    * ДоступноВПодчиненномУзлеРИБ - Булево
//                                  - Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в РИБ.
//        По умолчанию - Неопределено.
//    * ДоступноВАвтономномРабочемМесте - Булево
//                                      - Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в автономном рабочем месте.
//        По умолчанию - Неопределено.
//    * ДоступноВМоделиСервиса - Булево
//                             - Неопределено - Ложь, если необходимо блокировать выполнение регламентного
//        задания (в т.ч. задания очереди) в информационной базе с включенным использованием разделителя.
//        Значение Неопределено трактуется как Истина.
//        По умолчанию - Неопределено.
//    * РаботаетСВнешнимиРесурсами - Булево - Истина, если регламентное задание модифицирует данные
//        во внешних источниках (получение почты, синхронизация данных и т.п.). Не следует устанавливать
//        значение Истина для регламентных заданий, не модифицирующих данные во внешних источниках.
//        Например, регламентное задание ЗагрузкаКурсовВалют. Регламентные задания, работающие с внешними ресурсами,
//        автоматически отключаются в копии информационной базы. По умолчанию - Ложь.
//    * Параметризуется - Булево - Истина, если регламентное задание параметризованное.
//        По умолчанию - Ложь.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт

	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_ПолучениеДанныхWarehouse;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.гкс_ИспользоватьИнтеграциюСWarehouse;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;

	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_ОбработкаВходящихДанныхWarehouse;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.гкс_ИспользоватьИнтеграциюСWarehouse;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;

КонецПроцедуры

// Конец СтандартныеПодсистемы.РегламентныеЗадания

#КонецОбласти

// Выполняет запрос к сервису
//
// Параметры:
//   РесурсВебСервиса - СправочникСсылка.гкс_РесурсыВебСервисов
//   ПараметрыЗапроса - Структура
//   ПараметрыПреобразованияJSON - Структура
//
// Возвращаемое значение:
//   Структура - результат выполнения запроса.
//
Функция ВыполнитьЗапросКWarehouse(РесурсВебСервиса, ПараметрыЗапроса,
									ПараметрыПреобразованияJSON = Неопределено) Экспорт

	ПараметрыКоннектора = гкс_РаботаСВебСервисами.ПараметрыКоннектораHTTP(РесурсВебСервиса);

	Если ЗначениеЗаполнено(ПараметрыПреобразованияJSON) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыКоннектора.ПараметрыПреобразованияJSON, ПараметрыПреобразованияJSON);
	КонецЕсли;

	АдресРесурса = гкс_РаботаСВебСервисами.ПолныйАдресРесурса(РесурсВебСервиса, ПараметрыЗапроса);

	Возврат КоннекторHTTP.GetJson(АдресРесурса, Неопределено, ПараметрыКоннектора);

КонецФункции

// Делает запрос к warehouse и сохраняет данные в справочнике гкс_ВходящиеДанныеWarehouse.
//
// Параметры:
//  ПараметрПериоды - Неопределено - Параметр периоды
//
Процедура ПолучитьДанныеWarehouse(ПараметрПериоды = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ПараметрыЗапроса = ПараметрыПериодыИОрганизации(ПараметрПериоды);

	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл

		ЗагрузитьДанныеВнешниеПробы(ПараметрЗапроса);

	КонецЦикла;

КонецПроцедуры

// Обрабабатывает справочник гкс_ВходящиеДанныеWarehouse.
//
// Параметры:
//  ПараметрОбработки - Неопределено - Параметр обработки
//
Процедура ОбработатьВходящиеДанныеWarehouse(ПараметрОбработки = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ОбработатьВходящиеДанные(ПараметрОбработки);

КонецПроцедуры

// Выполняет HTTP-запрос к сервису Warehouse и преобразует полученный JSON-ответ в значение.
//
// Параметры:
//   Сервис - Структура - параметры для выполнения запроса к веб-сервису
//   ИмяСобытия - Строка - имя события для записи в журнал регистрации при ошибке
//
// Возвращаемое значение:
//   <Тип> - значение, полученное из JSON-ответа
//   Неопределено - если ответ не был получен или преобразование не удалось
//
Функция ВыполнитьHTTPЗапросИПрочитатьJSON(Сервис, ИмяСобытия) Экспорт

	Результат = Неопределено;
	Ответ = гкс_РаботаСВебСервисами.ВыполнитьЗапрос(Сервис, Новый Структура);

	ИсключениеПриОшибкеОбращенияКWarehouse(Ответ);

	Попытка
		Результат = JSONВЗначение(Ответ.ТелоВСтроке, ИменаСвойствСоЗначениемДаты());
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия,
		                         УровеньЖурналаРегистрации.Ошибка,
		                         Неопределено,
		                         Неопределено,
		                         ТекстОшибки);

		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());

	КонецПопытки;

	Возврат Результат;

КонецФункции

// Проверяет наличие реквизита в соответствии имен реквизитов и имен в сервисе
//
// Параметры:
//   КлючИЗначение - Структура - структура с ключом для поиска
//   НаименованияВСервисе - Соответствие - соответствие имен реквизитов и имен в сервисе
//
// Возвращаемое значение:
//   Булево - Истина, если реквизит найден в соответствии
//
Функция НайтиРеквизитШапки(КлючИЗначение, НаименованияВСервисе) Экспорт

	Возврат Не НаименованияВСервисе.Получить(КлючИЗначение.Ключ) = Неопределено;

КонецФункции

// Добавляет запись в регистр сведений с идентификатором для синхронизируемого объекта, если запись отсутствует.
//
// Параметры:
//   ДанныеЗаполнения - Структура - данные для заполнения полей регистра (свойства: ИдентификаторWarehouse, Наименование)
//   ОбъектСсылка - СправочникСсылка, ДокументСсылка - ссылка на синхронизируемый объект
//   ТипОбъекта - ПеречислениеСсылка.гкс_ТипыОбъектовWarehouse - тип объекта для поля регистра
//
Процедура ДобавитьВИдентификаторыСинхронизируемыхОбъектов(ДанныеЗаполнения, ОбъектСсылка, ТипОбъекта) Экспорт

	МенеджерИдОбъекты = РегистрыСведений.гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse;

	Если Не МенеджерИдОбъекты.ЗаписьЕстьВРегистре(ОбъектСсылка) Тогда

		ЗаписьЗначения 						= МенеджерИдОбъекты.СтруктураЗаписи();
		ЗаписьЗначения.Ссылка 				= ОбъектСсылка;
		ЗаписьЗначения.Идентификатор 		= ДанныеЗаполнения.ИдентификаторWarehouse;
		ЗаписьЗначения.НаименованиеОбъекта 	= ДанныеЗаполнения.Наименование;
		ЗаписьЗначения.ТипОбъекта 			= ТипОбъекта;

		МенеджерИдОбъекты.ДобавитьЗапись(ЗаписьЗначения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавить команду "Обновить классификатор".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  МестоРазмещенияКоманд - ГруппаФормы, Неопределено - Место размещения команд
//
Процедура ДобавитьКомандуЗагрузить(Форма, Знач МестоРазмещенияКоманд)

	Если МестоРазмещенияКоманд = Неопределено Тогда
		МестоРазмещенияКоманд = Форма.КоманднаяПанель;
	КонецЕсли;

	ИмяКоманды = "гкс_ЗагрузитьКлассификатор";

	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Действие = "Подключаемый_ВыполнитьКомандуИнтеграции";
		КомандаФормы.Заголовок = НСтр("ru='Загрузить классификатор'");
		КомандаФормы.Подсказка = НСтр("ru='Загрузить классификатор из Warehouse'");
		КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
		КомандаФормы.Отображение = ОтображениеКнопки.Текст;
	КонецЕсли;

	ИсходноеИмяЭлемента = "гкс_ЗагрузитьКлассификатор";

	ИмяЭлемента = ИсходноеИмяЭлемента;
	Пока Форма.Элементы.Найти(ИмяЭлемента) <> Неопределено Цикл
		ИмяЭлемента = Форма.Элементы.Найти(ИмяЭлемента).Имя;
		Итератор = СтрЗаменить(ИмяЭлемента, ИсходноеИмяЭлемента, "");
		Итератор = Число(?(ПустаяСтрока(Итератор),"0",Итератор));
		Итератор = Итератор + ?(Итератор = 0, 2, 1);
		ИмяЭлемента = ИсходноеИмяЭлемента + Формат(Итератор,"ЧГ=0");
	КонецЦикла;

	НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), МестоРазмещенияКоманд);
	НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;

КонецПроцедуры

#Область ПолучениеВнешнихДанных

// Обновляет данные классификатора для справочника по указанному имени формы.
//
// Параметры:
//   ИмяФормы - Строка - полное имя формы (например, "Справочник.Номенклатура.ФормаСписка")
//
Процедура ЗагрузитьКлассификатор(ИмяФормы) Экспорт

	МассивИмяФормы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяФормы, ".");
	Если МассивИмяФормы[0] = "Справочник" Тогда
		ИмяОбъекта = СтрШаблон("%1.%2", МассивИмяФормы[0], МассивИмяФормы[1]);
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяОбъекта);
		Менеджер.ОбновитьДанныеССервера();
	КонецЕсли;

КонецПроцедуры

Процедура ЗагрузитьДанныеВнешниеПробы(ПараметрЗапроса)

	МассивДанныхВнешниеПробы = ПолучитьВнешниеПробыПоВыбронномуAPI(ПараметрЗапроса);
	ДатаСоздания = ТекущаяДатаСеанса();

	Для Каждого ВнешняяПроба Из МассивДанныхВнешниеПробы Цикл

		ДанныеЗаполнения = Справочники.гкс_ВходящиеДанныеWarehouse.ИнициализироватьСтруктураНовогоЭлемента();
		ПодготовитьЗаполнениеВходящихДанных(ДанныеЗаполнения, ВнешняяПроба);
		ВходящиеДанныеСсылка = Справочники.гкс_ВходящиеДанныеWarehouse.НовыйЭлемент(ДанныеЗаполнения);

		РегистрыСведений.гкс_ОчередьОбработкиВходящихДанныхWarehouse
				.ЗафиксироватьНовыеВходящиеДанныеВОчереди(ВходящиеДанныеСсылка, ДатаСоздания);

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьВнешниеПробыПоВыбронномуAPI(ПараметрЗапроса)

	Результат = Неопределено;
	Сервис = Справочники.гкс_РесурсыВебСервисов.ExternalSamples_GetBetweenUpdDatesFilteredByClientIdOrStation;
	Ответ = гкс_РаботаСВебСервисами.ВыполнитьЗапрос(Сервис, ПараметрЗапроса);

	ИсключениеПриОшибкеОбращенияКWarehouse(Ответ);

	Попытка
		Результат = JSONВЗначение(Ответ.ТелоВСтроке, ИменаСвойствСоЗначениемДаты());
	Исключение
		Комментарий = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ИнтеграцияWarehouse.ПолучитьВнешниеПробы",
		                         УровеньЖурналаРегистрации.Ошибка,
		                         Неопределено,
		                         Неопределено,
		                         Комментарий);

		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());

	КонецПопытки;

	Возврат Результат;

КонецФункции

Функция ПараметрыПериодыИОрганизации(ПериодЗагрузки = Неопределено)

	МассивПараметрыЗапроса 	= Новый Массив;
	НастройкиИнтеграции 	= Справочники.гкс_НастройкиИнтеграцииWarehouse.НастройкиИнтеграции();
	ТаблицаОрганизации 		= НастройкиИнтеграции.ОтборПоОрганизации.Выгрузить();
	МенеджерИд 				= РегистрыСведений.гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse;

	ФорматДаты 				= ФорматДатыJSON.ISO;
	ВариантЗаписи 			= ВариантЗаписиДатыJSON.УниверсальнаяДата;

	Если ТипЗнч(ПериодЗагрузки) = Тип("Структура")
		И ПериодЗагрузки.Свойство("ДатаНачала") И ПериодЗагрузки.Свойство("ДатаКонец") Тогда

		НачалоЗагрузки = ПериодЗагрузки.ДатаНачала;
		ОкончаниеЗагрузки = ПериодЗагрузки.ДатаКонец;
	Иначе
		ТекДата 	= ТекущаяУниверсальнаяДата();
		НачалоЗагрузки = НачалоДня(ТекДата);
		ОкончаниеЗагрузки = КонецДня(ТекДата);
	КонецЕсли;

	ДатаНачала 	= ЗаписатьДатуJSON(НачалоЗагрузки, ФорматДаты, ВариантЗаписи);
	ДатаКонец 	= ЗаписатьДатуJSON(ОкончаниеЗагрузки, ФорматДаты, ВариантЗаписи);

	Для Каждого ТекСтрока Из ТаблицаОрганизации Цикл

		ИдОрганизации = МенеджерИд.ИдентификаторПоСсылкеНаОбъекта(ТекСтрока.Организация);

		Если ПустаяСтрока(ИдОрганизации) Тогда
			Продолжить;
		КонецЕсли;

		ПараметрыВыполнения = Новый Структура;
		ПараметрыВыполнения.Вставить("clientId", 		ИдОрганизации);
		ПараметрыВыполнения.Вставить("stationDestId", 	Неопределено);
		ПараметрыВыполнения.Вставить("updatedDateFrom", ДатаНачала);
		ПараметрыВыполнения.Вставить("updatedDateTo", 	ДатаКонец);

		ПараметрЗапроса = Новый Структура;
		ПараметрЗапроса.Вставить("ПараметрыЗапроса", ПараметрыВыполнения);

		МассивПараметрыЗапроса.Добавить(ПараметрЗапроса);

	КонецЦикла;

	Возврат МассивПараметрыЗапроса;

КонецФункции

Процедура ПодготовитьЗаполнениеВходящихДанных(ДанныеЗаполнения, ДанныеПробы)

	РеквизитыШапкиВСервисе 	= СоответствиеРеквизитовШапкиВходящихДанных();
	ТипыВходящихДанных 		= СоответствиеТиповВходящихДанных();

	Для Каждого КлючИЗначение Из ДанныеПробы Цикл

		Если НайтиРеквизитШапки(КлючИЗначение, РеквизитыШапкиВСервисе) Тогда

			ЗаполнитьРеквизитШапки(ДанныеЗаполнения, КлючИЗначение, РеквизитыШапкиВСервисе);

			// Если значение есть в шапке элемента справочника, то в табличную часть не добавляем.
			Продолжить;

		КонецЕсли;

		ЗаполнитьТабличнуюЧасть(ДанныеЗаполнения.ТекстыСообщения, КлючИЗначение, ТипыВходящихДанных);

	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРеквизитШапки(ДанныеЗаполнения, КлючИЗначение, НаименованияВСервисе)

	РеквизитШапки 					= НаименованияВСервисе.Получить(КлючИЗначение.Ключ);
	ДанныеЗаполнения[РеквизитШапки] = КлючИЗначение.Значение;

КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть(ТалицаЗаполнения, КлючИЗначение, ТипыВходящихДанных)

	ТипЗначения = ТипЗнч(КлючИЗначение.Значение);

	Если ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("Массив") Тогда
		СобратьЗначениеВСтрокуJSON(ТалицаЗаполнения, КлючИЗначение, ТипыВходящихДанных);
	Иначе
		ДобавитьСтрокуВТаблицуЗаполнения(ТалицаЗаполнения, КлючИЗначение, ТипыВходящихДанных);
	КонецЕсли;

КонецПроцедуры

Процедура СобратьЗначениеВСтрокуJSON(ТалицаЗаполнения, КлючИЗначение, ТипыВходящихДанных)

	ЗаписьJSON 		= Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, КлючИЗначение.Значение);
	Результат 		= ЗаписьJSON.Закрыть();

	ЗначениеСборки 	= Новый Структура;
	ЗначениеСборки.Вставить("Ключ", 	КлючИЗначение.Ключ);
	ЗначениеСборки.Вставить("Значение", Результат);

	ДобавитьСтрокуВТаблицуЗаполнения(ТалицаЗаполнения, ЗначениеСборки, ТипыВходящихДанных);

КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуЗаполнения(ТалицаЗаполнения, КлючИЗначение, ТипыВходящихДанных)

	НоваяСтрока = ТалицаЗаполнения.Добавить();
	НоваяСтрока.ТипОбъекта = ТипыВходящихДанных.Получить(КлючИЗначение.Ключ);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, КлючИЗначение);

КонецПроцедуры

Функция СоответствиеРеквизитовШапкиВходящихДанных()

	НаименованияВСервисе = Новый Соответствие;
 	НаименованияВСервисе.Вставить("date", 				"ДатаПробы");
	НаименованияВСервисе.Вставить("loadDate", 			"ДатаПогрузки");
	НаименованияВСервисе.Вставить("updatedOn", 			"ДатаИзменения");
	НаименованияВСервисе.Вставить("groupId", 			"ИДКомпозитнойПробы");
	НаименованияВСервисе.Вставить("id", 				"ИДПробы");
	НаименованияВСервисе.Вставить("commentary", 		"Комментарий");
	НаименованияВСервисе.Вставить("inspectionPlace", 	"МестоИнспекции");
	НаименованияВСервисе.Вставить("refId", 				"НомерДокумента");
	НаименованияВСервисе.Вставить("orderNumber", 		"НомерЗаявки");

	Возврат НаименованияВСервисе;

КонецФункции

Функция СоответствиеТиповВходящихДанных()

	МенеджерТипы 	= Перечисления.гкс_ТипыОбъектовWarehouse;

	ТипыОбъктов = Новый Соответствие;
 	ТипыОбъктов.Вставить("client", 						МенеджерТипы.Организация);
	ТипыОбъктов.Вставить("clientId", 					МенеджерТипы.Организация);
	ТипыОбъктов.Вставить("contractor", 					МенеджерТипы.Сюрвейер);
	ТипыОбъктов.Вставить("contractorId", 				МенеджерТипы.Сюрвейер);
	ТипыОбъктов.Вставить("elevator", 					МенеджерТипы.Элеватор);
	ТипыОбъктов.Вставить("elevatorId", 					МенеджерТипы.Элеватор);
	ТипыОбъктов.Вставить("goodId", 						МенеджерТипы.Продукция);
	ТипыОбъктов.Вставить("goodName", 					МенеджерТипы.Продукция);
	ТипыОбъктов.Вставить("goodShortName", 				МенеджерТипы.Продукция);
	ТипыОбъктов.Вставить("stationDestId", 				МенеджерТипы.СтанцияНазначения);
	ТипыОбъктов.Вставить("stationDestName", 			МенеджерТипы.СтанцияНазначения);
	ТипыОбъктов.Вставить("stationId", 					МенеджерТипы.СтанцияОтправления);
	ТипыОбъктов.Вставить("stationName", 				МенеджерТипы.СтанцияОтправления);
	ТипыОбъктов.Вставить("transport", 					МенеджерТипы.ТранспортноеСредство);
	ТипыОбъктов.Вставить("qualityIndicatorId", 			МенеджерТипы.Показатель);
	ТипыОбъктов.Вставить("priorityExSampleTypeName", 	МенеджерТипы.ВидПробы);
	ТипыОбъктов.Вставить("externalSampleTestResults", 	МенеджерТипы.ТаблицаПоказателиКачества);

	Возврат ТипыОбъктов;

КонецФункции

#КонецОбласти

#Область ОбработкаВоходящихДанных

Процедура ОбработатьВходящиеДанные(ПараметрОбработки)

	МенеджерВходящиеДанные = Справочники.гкс_ВходящиеДанныеWarehouse;
	МенеджерОчередиОбработки = РегистрыСведений.гкс_ОчередьОбработкиВходящихДанныхWarehouse;
	ОчередьОбработкиВходящихДанных = МенеджерОчередиОбработки.ВыборкаИзОчереди(ПараметрОбработки);

	Пока ОчередьОбработкиВходящихДанных.Следующий() Цикл

		// Проверка на битую ссылку.
		Если ОчередьОбработкиВходящихДанных.ВходящиеДанные.ПолучитьОбъект() = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Отказ = Ложь;
		ДанныеОбработки = МенеджерОчередиОбработки.СтруктураЗаписи();
		ЗаполнитьЗначенияСвойств(ДанныеОбработки, ОчередьОбработкиВходящихДанных);

		НачатьТранзакцию();

		Попытка

			ВыполнитьОбработкуЭлементаОчереди(ОчередьОбработкиВходящихДанных, ДанныеОбработки, Отказ);

			Если Не Отказ Тогда

				МенеджерОчередиОбработки.УдалитьОбработкуВходящихДанныхВОчереди(
					ОчередьОбработкиВходящихДанных.ВходящиеДанные, ОчередьОбработкиВходящихДанных.Порядок);

				МенеджерВходящиеДанные.ЗаблокироватьДанныеПоСсылке(ОчередьОбработкиВходящихДанных.ВходящиеДанные);
				МенеджерВходящиеДанные.УстановитьПризнакОбработан(ОчередьОбработкиВходящихДанных.ВходящиеДанные);

			КонецЕсли;

			ЗафиксироватьТранзакцию();

		Исключение

			ОтменитьТранзакцию();

			ТекОшибкаИнформация = ИнформацияОбОшибке();
			ОписаниеОшибки 		= ОбработкаОшибок.ПодробноеПредставлениеОшибки(ТекОшибкаИнформация);

			ЗапистьОшибкуОбработки(ДанныеОбработки, ОписаниеОшибки);
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Процедура ЗапистьОшибкуОбработки(ДанныеОбработки, ОписаниеОшибки)

	МенеджерОчередиОбработки = РегистрыСведений.гкс_ОчередьОбработкиВходящихДанныхWarehouse;

	Если ПустаяСтрока(ДанныеОбработки.СообщениеОбОшибкеОбработки) Тогда
		Разделитель = "";
	Иначе
		Разделитель = Символы.ПС;
	КонецЕсли;

	СообщениеОбОшибкеОбработки = Новый Массив;
	СообщениеОбОшибкеОбработки.Добавить(ДанныеОбработки.СообщениеОбОшибкеОбработки);
	Если ЗначениеЗаполнено(ДанныеОбработки.СообщениеОбОшибкеОбработки) Тогда
		СообщениеОбОшибкеОбработки.Добавить(Символы.ПС);
	КонецЕсли;
	СообщениеОбОшибкеОбработки.Добавить(ТекущаяДатаСеанса());
	СообщениеОбОшибкеОбработки.Добавить(ОписаниеОшибки);

	ДанныеОбработки.СообщениеОбОшибкеОбработки = СтрСоединить(СообщениеОбОшибкеОбработки, Разделитель);
	ДанныеОбработки.КоличествоНеудачныхОбработок = ДанныеОбработки.КоличествоНеудачныхОбработок + 1;

	МенеджерОчередиОбработки.ЗафиксироватьИзмененияВходящихДанныхВОчереди(ДанныеОбработки);

КонецПроцедуры

Процедура ВыполнитьОбработкуЭлементаОчереди(ЭлементОчередиВходящихДанных, ДанныеОбработки, Отказ)

	РезультатЗапроса = гкс_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
						ЭлементОчередиВходящихДанных.ВходящиеДанные, "ТекстыСообщения");
	ДанныеWarehouse = РезультатЗапроса.Выгрузить();

	МенеджерВнешниеПробы = РегистрыСведений.гкс_ВнешниеПробы;
	ДанныеВнешнейПробы = МенеджерВнешниеПробы.СтруктураЗаписи();

	ЗаполнитьПростыеЗначенияВСтрокуВнешняяПроба(ЭлементОчередиВходящихДанных.ВходящиеДанные,
												ДанныеWarehouse, ДанныеВнешнейПробы);

	ЗаполнитьОрганизацияВСтрокуВнешняяПроба(ДанныеWarehouse, 		ДанныеВнешнейПробы);
	ЗаполнитьПродукциюВСтрокуВнешняяПроба(ДанныеWarehouse, 			ДанныеВнешнейПробы);
	ЗаполнитьСюрвейерВСтрокуВнешняяПроба(ДанныеWarehouse, 			ДанныеВнешнейПробы);
	ЗаполнитьЭлеваторВСтрокуВнешняяПроба(ДанныеWarehouse, 			ДанныеВнешнейПробы);
	ЗаполнитьСтанцииЖДВСтрокуВнешняяПроба(ДанныеWarehouse, 			ДанныеВнешнейПробы);
	ЗаполнитьТранспортныеСредстваВСтрокуВнешняяПроба(ДанныеWarehouse, ДанныеВнешнейПробы);

	Если Не РеквизитыВнешнейПробыЗаполнены(РеквизитыДляПроверки(),
		ДанныеВнешнейПробы, ДанныеОбработки) Тогда

		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ТаблицаВнешняяПроба = МенеджерВнешниеПробы.ИнициализироватьТаблицуВнешнейПробы();
	МассивТаблицПоказателей = ТаблицыПоказателейКачества(ДанныеWarehouse);

	// заполнение таблицы показателей анализа
	Для Каждого ТекущаяТаблица Из МассивТаблицПоказателей Цикл

		ПрочитатьЗаполнитьПоТаблицеПоказателейКачества(
			ТекущаяТаблица, ТаблицаВнешняяПроба,
			ДанныеВнешнейПробы, ДанныеОбработки,
			Отказ);
	КонецЦикла;

	Если ТаблицаВнешняяПроба.Количество() = 0 Тогда
		ШаблоныСообщения 	= ШаблоныСообщенияПроверкиЗаполнения();
		ОписаниеОшибки 		= ШаблоныСообщения.НулевоеЗначение;
		ЗапистьОшибкуОбработки(ДанныеОбработки, ОписаниеОшибки);

		Отказ = Истина;

	Иначе

		Для Каждого ТекСтрока Из ТаблицаВнешняяПроба Цикл
			СтруктураЗаписи	= МенеджерВнешниеПробы.СтруктураЗаписи();
			ЗаполнитьЗначенияСвойств(СтруктураЗаписи, ТекСтрока);
			МенеджерВнешниеПробы.ДобавитьЗапись(СтруктураЗаписи);
		КонецЦикла;

		// заполнение  документа
        Документы.гкс_ВнешняяПроба.ОбновитьПоДаннымWarehouse(ТаблицаВнешняяПроба);

	КонецЕсли;

КонецПроцедуры

#Область ПодборИЗаполнение

Процедура ЗаполнитьПростыеЗначенияВСтрокуВнешняяПроба(ВходящиеДанные, ДанныеWarehouse, ДанныеВнешнейПробы)

	ЗаполнитьЗначенияСвойств(ДанныеВнешнейПробы, ВходящиеДанные);

	ДанныеВнешнейПробы.Период = ВходящиеДанные.ДатаСоздания;
	ДанныеВнешнейПробы.ВходящиеДанные = ВходящиеДанные;

	ЗаполнитьПоКлючуВСтрокуВнешняяПроба(ДанныеWarehouse, ДанныеВнешнейПробы, "weightGross", "ВесБрутто");
	ЗаполнитьПоКлючуВСтрокуВнешняяПроба(ДанныеWarehouse, ДанныеВнешнейПробы, "weightTare", 	"ВесТары");
	ЗаполнитьПоКлючуВСтрокуВнешняяПроба(ДанныеWarehouse, ДанныеВнешнейПробы, "weightNet", 	"ВесНетто");

КонецПроцедуры

// Обработать Организация ("client")
//
Процедура ЗаполнитьОрганизацияВСтрокуВнешняяПроба(ДанныеWarehouse, ДанныеПробы)

	ЗаполнитьЗначенияВСтрокуВнешнейПробы(ДанныеWarehouse,
										ДанныеПробы,
										Перечисления.гкс_ТипыОбъектовWarehouse.Организация,
										"Организация");

КонецПроцедуры

// Обработать Продукция("good")
//
Процедура ЗаполнитьПродукциюВСтрокуВнешняяПроба(ДанныеWarehouse, ДанныеПробы)

	ЗаполнитьЗначенияВСтрокуВнешнейПробы(ДанныеWarehouse,
										ДанныеПробы,
										Перечисления.гкс_ТипыОбъектовWarehouse.Продукция,
										"Продукция");

КонецПроцедуры

// Обработать сюрвейер("contractor")
//
Процедура ЗаполнитьСюрвейерВСтрокуВнешняяПроба(ДанныеWarehouse, ДанныеПробы)

	ЗаполнитьЗначенияВСтрокуВнешнейПробы(ДанныеWarehouse,
										ДанныеПробы,
										Перечисления.гкс_ТипыОбъектовWarehouse.Сюрвейер,
										"Сюрвейер");

КонецПроцедуры

// Обработать Элеватор("elevator")
//
Процедура ЗаполнитьЭлеваторВСтрокуВнешняяПроба(ДанныеWarehouse, ДанныеПробы)

	ЗаполнитьЗначенияВСтрокуВнешнейПробы(ДанныеWarehouse,
										ДанныеПробы,
										Перечисления.гкс_ТипыОбъектовWarehouse.Элеватор,
										"Элеватор");

КонецПроцедуры

// Обработать СтанцияОтправления, СтанцияНазначения("station", "stationDest")
//
Процедура ЗаполнитьСтанцииЖДВСтрокуВнешняяПроба(ДанныеWarehouse, ДанныеПробы)

	МенеджерТипы = Перечисления.гкс_ТипыОбъектовWarehouse;

	ЗаполнитьЗначенияВСтрокуВнешнейПробы(ДанныеWarehouse,
										ДанныеПробы,
										МенеджерТипы.СтанцияОтправления,
										"СтанцияОтправления");

	ЗаполнитьЗначенияВСтрокуВнешнейПробы(ДанныеWarehouse,
										ДанныеПробы,
										МенеджерТипы.СтанцияНазначения,
										"СтанцияНазначения");

КонецПроцедуры

// Обработать транспортное средство, номер ТС("transport")
//
Процедура ЗаполнитьТранспортныеСредстваВСтрокуВнешняяПроба(ДанныеWarehouse, СтрокаВнешняяПроба)

	МенеджерТипы 			= Перечисления.гкс_ТипыОбъектовWarehouse;
	МенеджерТС 				= Справочники.ТранспортныеСредства;
	СвойствоЗначения 		= ДанныеWarehouse.Найти(МенеджерТипы.ТранспортноеСредство, "ТипОбъекта");
	ТекстRUS 				= "RUS";
	ТранспортноеСредство 	= Справочники.ТранспортныеСредства.ПустаяСсылка();

	Если Не СвойствоЗначения = Неопределено Тогда

		Номер 				= УбратьСпецСимволы(СвойствоЗначения.Значение);
		ЭтоНомерЖДВагона 	= гкс_СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Номер);

		Если Не ЭтоНомерЖДВагона Тогда

			НомерЛатиница 			= МенеджерТС.НормироватьНомер(Номер);
			НомерЛатиницаRUS 		= НомерЛатиница + ТекстRUS;
			НомерКирилица       	= ИзменитьНомерНаКирилицу(Номер);
			НомерКирилицаRUS    	= НомерКирилица + ТекстRUS;

			РазныеВариантыНомера 	= Новый Структура;
			РазныеВариантыНомера.Вставить("НомерЛатиница", 		НомерЛатиница);
			РазныеВариантыНомера.Вставить("НомерЛатиницаRUS", 	НомерЛатиницаRUS);
			РазныеВариантыНомера.Вставить("НомерКирилица", 		НомерКирилица);
			РазныеВариантыНомера.Вставить("НомерКирилицаRUS", 	НомерКирилицаRUS);

			ТранспортноеСредство 	= ПоискТранспортныеСредстваПоНомерам(РазныеВариантыНомера);

		Иначе
			ТранспортноеСредство = МенеджерТС.ТранспортноеСредствоПоНомеру(Номер);
		КонецЕсли;

		СтрокаВнешняяПроба.ТранспортноеСредство = ТранспортноеСредство;
		СтрокаВнешняяПроба.НомерТС 				= Номер;

	КонецЕсли;

КонецПроцедуры

Функция ТаблицыПоказателейКачества(ДанныеWarehouse)

	МенеджерТипы = Перечисления.гкс_ТипыОбъектовWarehouse;
	Отбор = Новый Структура("ТипОбъекта", МенеджерТипы.ТаблицаПоказателиКачества);

	Возврат ДанныеWarehouse.НайтиСтроки(Отбор);

КонецФункции

Процедура ПрочитатьЗаполнитьПоТаблицеПоказателейКачества(ТекущаяТаблица, ТаблицаВнешняяПроба,
														ОсновноеДанныеВнешнейПробы, ДанныеОбработки,
														Отказ)

	МенеджерИд = РегистрыСведений.гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse;
	ДанныеТаблицы = ПрочитатьЗначениеИзСтрокиJSON(ТекущаяТаблица.Значение);

	Для Каждого ТекущаяСтрока Из ДанныеТаблицы Цикл

		ЗначениеПоказателя = Число(ТекущаяСтрока.value);

		// не добавляем показатели с нулевыми значениями
		Если ЗначениеПоказателя = 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаВнешняяПроба = ТаблицаВнешняяПроба.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВнешняяПроба, ОсновноеДанныеВнешнейПробы);

		СтрокаВнешняяПроба.ВидПробы = ВидПробыПоИмени(ТекущаяСтрока);
		СтрокаВнешняяПроба.Показатель = МенеджерИд.СсылкаОбъектаПоИдентификатору(ТекущаяСтрока.qualityIndicatorId);
		СтрокаВнешняяПроба.ЗначениеПоказателя = ЗначениеПоказателя;

		Если Не РеквизитыВнешнейПробыЗаполнены(
			РеквизитыТаблицыДляПроверки(), СтрокаВнешняяПроба, ДанныеОбработки) Тогда

			Отказ = Истина;
			ТаблицаВнешняяПроба.Удалить(СтрокаВнешняяПроба);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПоКлючуВСтрокуВнешняяПроба(ДанныеWarehouse, СтрокаВнешняяПроба, Ключ, ИмяЗначения)

	СвойствоЗначения = ДанныеWarehouse.Найти(Ключ, "Ключ");

	Если Не СвойствоЗначения = Неопределено Тогда
		СтрокаВнешняяПроба[ИмяЗначения]	= Число(СвойствоЗначения.Значение);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьЗначенияВСтрокуВнешнейПробы(ДанныеWarehouse, СтрокаВнешняяПроба, ТипОбъекта, ИмяЗначения)

	МенеджерИдОбъекты = РегистрыСведений.гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse;

	Отбор = Новый Структура("ТипОбъекта", ТипОбъекта);
	МассивСвойствЗначений = ДанныеWarehouse.НайтиСтроки(Отбор);

	Если МассивСвойствЗначений.Количество() > 0 Тогда

		ЗаписьЗначения = МенеджерИдОбъекты.СтруктураЗаписи();

		ОбработатьМассивСвойствЗначений(МассивСвойствЗначений, ЗаписьЗначения);

		ЗаписьЗначения.ТипОбъекта = ТипОбъекта;

		Если ЗначениеЗаполнено(ЗаписьЗначения.Идентификатор) Тогда

			СсылкаИБ = МенеджерИдОбъекты.СсылкаОбъектаПоИдентификатору(ЗаписьЗначения.Идентификатор);

			Если ЗначениеЗаполнено(СсылкаИБ) Тогда
				ЗаписьЗначения.Ссылка = СсылкаИБ;
				СтрокаВнешняяПроба[ИмяЗначения] = СсылкаИБ;
			Иначе
				МенеджерИдОбъекты.ДобавитьЗапись(ЗаписьЗначения);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьМассивСвойствЗначений(МассивСвойствЗначений, ЗаписьЗначения)

	Для Каждого Свойство Из МассивСвойствЗначений Цикл

		Если ЕстьShortВИмениСвойства(Свойство.Ключ) Тогда
			Продолжить;
		КонецЕсли;

		Если ЕстьIDВИмениСвойства(Свойство.Ключ) Тогда
			ЗаписьЗначения.Идентификатор = Свойство.Значение;
		КонецЕсли;

		Если Свойство.Ключ = "contractor" Или Свойство.Ключ = "elevator" Тогда
			ДанныеContractor = ПрочитатьЗначениеИзСтрокиJSON(Свойство.Значение);
			ДанныеContractor.Свойство("name", ЗаписьЗначения.НаименованиеОбъекта);
		КонецЕсли;

		Если ЕстьNameВИмениСвойства(Свойство.Ключ) Тогда
			ЗаписьЗначения.НаименованиеОбъекта = Свойство.Значение;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПрочитатьЗначениеИзСтрокиJSON(ТелоВСтроке)

	Если ПустаяСтрока(ТелоВСтроке) Тогда
		Возврат Новый Структура;
	КонецЕсли;

	Результат = JSONВЗначение(ТелоВСтроке, ИменаСвойствСоЗначениемДаты());

	Возврат Результат;

КонецФункции

Функция ЕстьIDВИмениСвойства(ИмяСвойства)

	Возврат Не СтрНайти(ИмяСвойства, "Id") = 0;

КонецФункции

Функция ЕстьNameВИмениСвойства(ИмяСвойства)

	Возврат Не СтрНайти(ИмяСвойства, "Name") = 0;

КонецФункции

Функция ЕстьShortВИмениСвойства(ИмяСвойства)

	Возврат Не СтрНайти(ИмяСвойства, "Short") = 0;

КонецФункции

Функция ВидПробыПоИмени(ТекущаяСтрока)

	ИмяВСервисе 			= "";
	МенеджерНазначения 		= Перечисления.гкс_НазначенияИспользованияКачества;
	ТипСтруктура 			= Тип("Структура");

	ЕстьExternalSampleType 	= ТипЗнч(ТекущаяСтрока) = ТипСтруктура
								И ТекущаяСтрока.Свойство("externalSampleType")
								И ТипЗнч(ТекущаяСтрока.externalSampleType) = ТипСтруктура
								И ТекущаяСтрока.externalSampleType.Свойство("name_en");

	Если ЕстьExternalSampleType Тогда
		ИмяВСервисе = ТекущаяСтрока.externalSampleType.name_en;
	КонецЕсли;

	Если ПустаяСтрока(ИмяВСервисе) Тогда
		Возврат МенеджерНазначения.ПустаяСсылка();
	КонецЕсли;

	СоответствиеПоИмени =  Новый Соответствие;
	СоответствиеПоИмени.Вставить("Express", 	МенеджерНазначения.ЛаборантВнешниеПробы);
	СоответствиеПоИмени.Вставить("Elevator", 	МенеджерНазначения.ЭлеваторВнешниеПробы);
	СоответствиеПоИмени.Вставить("Composite", 	МенеджерНазначения.КомпозитВнешниеПробыНаТысячуТон);

	Возврат СоответствиеПоИмени.Получить(ИмяВСервисе);

КонецФункции

#КонецОбласти

#Область ПровекраЗаполнения

Функция РеквизитыВнешнейПробыЗаполнены(РеквизитыДляПроверки, ДанныеВнешнейПробы, ДанныеОбработки)

	ШаблоныСообщения 	= ШаблоныСообщенияПроверкиЗаполнения();
	ШаблонОшибки 		= ШаблоныСообщения.ШаблонОшибки;
	НазваниеАРМа		= ШаблоныСообщения.НазваниеАРМа;
	СтрокаПричины	 	= ШаблоныСообщения.СтрокаПричины;
	СтрокаНеЗаполнен 	= ШаблоныСообщения.СтрокаНеЗаполнен;
	СтрокаСопоставить 	= ШаблоныСообщения.СтрокаСопоставить;

	ОшибкиЗаполнения = Новый Массив;
	Для Каждого ИмяРеквизита Из РеквизитыДляПроверки Цикл

		Если Не ЗначениеЗаполнено(ДанныеВнешнейПробы[ИмяРеквизита]) Тогда
			ОшибкиЗаполнения.Добавить(СтрШаблон(ШаблонОшибки, ИмяРеквизита));
		КонецЕсли;

	КонецЦикла;

	Если ЗначениеЗаполнено(ОшибкиЗаполнения) Тогда

		ОшибкиЗаполнения.Добавить(СтрокаПричины);
		ОшибкиЗаполнения.Добавить(СтрокаНеЗаполнен);
		ОшибкиЗаполнения.Добавить(СтрШаблон(СтрокаСопоставить, НазваниеАРМа));

		ОписаниеОшибки = СтрСоединить(ОшибкиЗаполнения, Символы.ПС);
		ЗапистьОшибкуОбработки(ДанныеОбработки, ОписаниеОшибки);

	КонецЕсли;

	Возврат Не ЗначениеЗаполнено(ОшибкиЗаполнения);

КонецФункции

Функция ШаблоныСообщенияПроверкиЗаполнения()

	ШаблоныСообщения = Новый Структура;
	ШаблоныСообщения.Вставить("ШаблонОшибки", 		НСтр("ru = 'Не удалось заполнить реквизит ""%1"".'"));
	ШаблоныСообщения.Вставить("НазваниеАРМа",		НСтр("ru = 'АРМ ""Соответствие идентификаторов Warehouse""'"));
	ШаблоныСообщения.Вставить("СтрокаПричины",	 	НСтр("ru = 'Причины:'"));

	ШаблоныСообщения.Вставить("НулевоеЗначение",
		НСтр("ru = 'Значение показателя равно 0.
		|Нулевые значения показателей качества внешних проб не записываются.'"));

	ШаблоныСообщения.Вставить("СтрокаНеЗаполнен",
		НСтр("ru = '1. Возможно во ""Входящих дынных"" значение внешней пробы не заполнено.'"));

	ШаблоныСообщения.Вставить("СтрокаСопоставить",
		НСтр("ru = '2. Необходимо в %1 сопоставить значение и ссылку элемента справочника.'"));

	Возврат ШаблоныСообщения;

КонецФункции

Функция РеквизитыДляПроверки()

	СписокРеквизитов = Новый Массив;
	СписокРеквизитов.Добавить("ДатаПробы");
	СписокРеквизитов.Добавить("ДатаПогрузки");
	СписокРеквизитов.Добавить("ДатаИзменения");
	СписокРеквизитов.Добавить("ИДПробы");
	СписокРеквизитов.Добавить("МестоИнспекции");
	СписокРеквизитов.Добавить("НомерЗаявки");
	СписокРеквизитов.Добавить("Продукция");
	СписокРеквизитов.Добавить("Сюрвейер");
	СписокРеквизитов.Добавить("ТранспортноеСредство");
	СписокРеквизитов.Добавить("НомерТС");
	СписокРеквизитов.Добавить("ВесБрутто");
	СписокРеквизитов.Добавить("ВесТары");
	СписокРеквизитов.Добавить("ВесНетто");

	Возврат СписокРеквизитов;

КонецФункции

Функция РеквизитыТаблицыДляПроверки()

	СписокРеквизитов = Новый Массив;
	СписокРеквизитов.Добавить("ВидПробы");
	СписокРеквизитов.Добавить("Показатель");

	Возврат СписокРеквизитов;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СинхнронизацияПоказателейКачества

Процедура СинхнронизацияПоказателейКачества() Экспорт

	Если ПустаяСтрока(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	МенеджерПоказатели 	= Справочники.гкс_ПоказателиКачестваWarehouse;
	МассивДанных 		= ПолучитьКачественныеПоказателиПоAPI();
    ТипОбъекта			= Перечисления.гкс_ТипыОбъектовWarehouse.Показатель;

	Для Каждого ДанныеПоказатель Из МассивДанных Цикл

		ДанныеЗаполнения 	= МенеджерПоказатели.ИнициализироватьСтруктураНовогоЭлемента();
		ПодготовитьЗаполнениеПоказателиКачества(ДанныеЗаполнения, ДанныеПоказатель);
		ПоказательСсылка	= МенеджерПоказатели.ПоказательПоИдентификатору(ДанныеЗаполнения.ИдентификаторWarehouse);

		Если Не ЗначениеЗаполнено(ПоказательСсылка) Тогда
			ПоказательСсылка = МенеджерПоказатели.НовыйЭлемент(ДанныеЗаполнения);
		Иначе
			ДополнитьПоказательКачестваПоНеобходимостиСсылочнымиРеквизитами(ДанныеЗаполнения, ПоказательСсылка);
		КонецЕсли;

		ДобавитьВИдентификаторыСинхронизируемыхОбъектов(ДанныеЗаполнения, ПоказательСсылка, ТипОбъекта);

	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьЗаполнениеПоказателиКачества(ДанныеЗаполнения, ДанныеПоказатель)

	РеквизитыШапкиВСервисе 	= СоответствиеРеквизитовПоказателейКачества();

	Для Каждого КлючИЗначение Из ДанныеПоказатель Цикл

		Если НайтиРеквизитШапки(КлючИЗначение, РеквизитыШапкиВСервисе) Тогда

			ЗаполнитьРеквизитШапкиПоказателей(ДанныеЗаполнения, КлючИЗначение, РеквизитыШапкиВСервисе);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРеквизитШапкиПоказателей(ДанныеЗаполнения, КлючИЗначение, РеквизитыШапкиВСервисе)

	ИмяРеквизита 		= РеквизитыШапкиВСервисе.Получить(КлючИЗначение.Ключ);
	ЗначениеЗаполнения 	= ДанныеЗаполнения[ИмяРеквизита];

	Если ОбщегоНазначенияКлиентСервер.ЭтоЧисло(ЗначениеЗаполнения) Тогда
		ДанныеЗаполнения[ИмяРеквизита] = Число(КлючИЗначение.Значение);
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ЗначениеЗаполнения)) Тогда
		ЗаполнитьЗначениеСсылкиВПоказателеКачества(ДанныеЗаполнения, КлючИЗначение, ИмяРеквизита);
	Иначе
		ДанныеЗаполнения[ИмяРеквизита] = КлючИЗначение.Значение;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьЗначениеСсылкиВПоказателеКачества(ДанныеЗаполнения, КлючИЗначение, ИмяРеквизита)

	МенеджерИдОбъекты 	= РегистрыСведений.гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse;
	СсылкаПоИД 			= МенеджерИдОбъекты.СсылкаОбъектаПоИдентификатору(КлючИЗначение.Значение);

	Если ЗначениеЗаполнено(СсылкаПоИД) Тогда
		ДанныеЗаполнения[ИмяРеквизита] = СсылкаПоИД;
	Иначе
		Если ТипЗнч(ДанныеЗаполнения[ИмяРеквизита]) = Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения") Тогда
			ЗаписатьЕдиницуИзмеренияВИдентификаторыСинхронизируемыхОбъектов(КлючИЗначение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьЕдиницуИзмеренияВИдентификаторыСинхронизируемыхОбъектов(КлючИЗначение)

	Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
		Возврат;
	КонецЕсли;

	МенеджерИдОбъекты 		= РегистрыСведений.гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse;
	ДанныеЕдинициИзмерения 	= ПолучитьЕдиницуИзмеренияПоВыбронномуAPI(КлючИЗначение.Значение);

	ЗаписьЗначения 					= МенеджерИдОбъекты.СтруктураЗаписи();
	ЗаписьЗначения.Идентификатор 	= КлючИЗначение.Значение;
	ЗаписьЗначения.ТипОбъекта 		= Перечисления.гкс_ТипыОбъектовWarehouse.ЕдиницыИзмерения;

	Если ТипЗнч(ДанныеЕдинициИзмерения) = Тип("Структура") Тогда
		ДанныеЕдинициИзмерения.Свойство("name", ЗаписьЗначения.НаименованиеОбъекта);
	КонецЕсли;

	МенеджерИдОбъекты.ДобавитьЗапись(ЗаписьЗначения);

КонецПроцедуры

Процедура ДополнитьПоказательКачестваПоНеобходимостиСсылочнымиРеквизитами(ДанныеЗаполнения, ПоказательСсылка)

	ОбъектПоказатель = ПоказательСсылка.ПолучитьОбъект();

	ЗаполнитьЗначенияСвойств(ОбъектПоказатель, ДанныеЗаполнения,, "ЕдиницаИзмерения");

	Если Не ЗначениеЗаполнено(ОбъектПоказатель.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(ДанныеЗаполнения.ЕдиницаИзмерения) Тогда

		ОбъектПоказатель.ЕдиницаИзмерения 	= ДанныеЗаполнения.ЕдиницаИзмерения;

	КонецЕсли;

	ОбъектПоказатель.Записать();

КонецПроцедуры

Функция ПолучитьКачественныеПоказателиПоAPI()

	МассивУникальныхИД	= ПолучитьМаппингКачественныхПоказателей();
	МассивВсеПоказатели = ПолучитьВсеКачественныеПоказатели();
	МассивДанных 		= Новый Массив;

	Для Каждого Показатель Из МассивВсеПоказатели Цикл

		НайденИД = МассивУникальныхИД.Найти(Показатель.id);

		Если ЗначениеЗаполнено(НайденИД) Тогда
			МассивДанных.Добавить(Показатель);
		КонецЕсли;

	КонецЦикла;

	Возврат МассивДанных;

КонецФункции

Функция ПолучитьМаппингКачественныхПоказателей()

	МассивУникальныхИД 	= Новый Массив;
	Сервис 				= Справочники.гкс_РесурсыВебСервисов.QualityIndicatorCodes;
	ИмяСобытия 			= ИмяСобытияПолучитьКачественныеПоказатели();
    Результат 			= ВыполнитьHTTPЗапросИПрочитатьJSON(Сервис, ИмяСобытия);

	Если ЗначениеЗаполнено(Результат) Тогда

		Для Каждого Маппинг Из Результат Цикл

			Если ЗначениеЗаполнено(Маппинг.qualityIndicatorId) Тогда
				МассивУникальныхИД.Добавить(Маппинг.qualityIndicatorId);
			КонецЕсли;

		КонецЦикла;

		ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивУникальныхИД);
	КонецЕсли;

	Возврат МассивУникальныхИД;

КонецФункции

Функция ПолучитьВсеКачественныеПоказатели()

	Сервис = Справочники.гкс_РесурсыВебСервисов.QualityIndicators;
	ИмяСобытия = ИмяСобытияПолучитьКачественныеПоказатели();
	Возврат ВыполнитьHTTPЗапросИПрочитатьJSON(Сервис, ИмяСобытия);

КонецФункции

Функция СоответствиеРеквизитовПоказателейКачества()

	НаименованияВСервисе = Новый Соответствие;
 	НаименованияВСервисе.Вставить("name", 									"Наименование");
	НаименованияВСервисе.Вставить("shortName", 								"НаименованиеКороткое");
	НаименованияВСервисе.Вставить("unitId", 								"ЕдиницаИзмерения");
	НаименованияВСервисе.Вставить("standard", 								"Стандарт");
	НаименованияВСервисе.Вставить("precision", 								"Точность");
	НаименованияВСервисе.Вставить("dependentQualityIndicatorId", 			"ЗависимыйПоказатель");
	НаименованияВСервисе.Вставить("maxValueOfDependentQualityIndicator", 	"ВерхнийПределЗависимогоПоказателя");
	НаименованияВСервисе.Вставить("minValueOfDependentQualityIndicator", 	"НижнийПределЗависимогоПоказателя");
	НаименованияВСервисе.Вставить("code", 									"КодWarehouse");
	НаименованияВСервисе.Вставить("id", 									"ИдентификаторWarehouse");

	Возврат НаименованияВСервисе;

КонецФункции

Функция ИмяСобытияПолучитьКачественныеПоказатели()

	Возврат "ИнтеграцияWarehouse.ПолучитьКачественныеПоказатели";

КонецФункции

#КонецОбласти

#Область СинхнронизацияЕдиницИзмерения

Функция ПолучитьЕдиницуИзмеренияПоВыбронномуAPI(СтрокаИД)

	Результат = Неопределено;
	Сервис = Справочники.гкс_РесурсыВебСервисов.UnitCodes_GetById;
	Ответ = гкс_РаботаСВебСервисами.ВыполнитьЗапрос(Сервис, ПараметрыУстановитьИД(СтрокаИД));

	ИсключениеПриОшибкеОбращенияКWarehouse(Ответ);

	Попытка
		Результат = JSONВЗначение(Ответ.ТелоВСтроке, ИменаСвойствСоЗначениемДаты());
	Исключение
		Комментарий = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ИнтеграцияWarehouse.ПолучитьВнешниеПробы",
		                         УровеньЖурналаРегистрации.Ошибка,
		                         Неопределено,
		                         Неопределено,
		                         Комментарий);

		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());

	КонецПопытки;

	Возврат Результат;

КонецФункции

Функция ПараметрыУстановитьИД(СтрокаИД)

	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Id", СтрокаИД);

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ПараметрыЗапроса", ПараметрыВыполнения);

	Возврат ПараметрыЗапроса;

КонецФункции

#КонецОбласти

#Область ОбщиеМетоды

Процедура ИсключениеПриОшибкеОбращенияКWarehouse(Ответ)

	Коды = КоннекторHTTP.КодыСостоянияHTTP();

	Если Ответ.КодСостояния < Коды.ОК_200 Или Ответ.КодСостояния >= Коды.МножествоВыборов_300 Тогда
		ВызватьИсключение НСтр("ru='Ошибка обращение к Warehouse'");
	КонецЕсли;

КонецПроцедуры

Функция ИменаСвойствСоЗначениемДаты()

	МассивДат = Новый Массив;
	МассивДат.Добавить("date");
	МассивДат.Добавить("loadDate");
	МассивДат.Добавить("updatedOn");

	Возврат МассивДат;

КонецФункции

Функция УбратьСпецСимволы(Номер)

	ВсеСпецСимволы = "`~!@#$%^&*()-=+[](){}\|/<>?:;№' ";

	Для Инд = 1 По СтрДлина(Номер) Цикл

		ОдинСимвол = Сред(Номер, Инд, 1);

		Если СтрНайти(ВсеСпецСимволы, ОдинСимвол) > 0 Тогда
			Номер = СтрЗаменить(Номер, ОдинСимвол, "");
		КонецЕсли;

	КонецЦикла;

	Возврат Номер;

КонецФункции

Функция ИзменитьНомерНаКирилицу(Номер)

	Результат = "";

	Для а = 1 По СтрДлина(Номер) Цикл

		СимволПроверки 	= Сред(Номер, а, 1);
		СимволПроверки 	= ВРег(СимволПроверки);

		КодСимвола 		= КодСимвола(СимволПроверки);

		ЭтоЦифра 		= СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СимволПроверки);
		ЭтоКириллица    = СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(СимволПроверки);
		ЭтоЛатиница     = СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(СимволПроверки);
		ЭтоБуква 		= ЭтоКириллица Или ЭтоЛатиница;

		Если ЭтоЦифра Или ЭтоКириллица Тогда

			Результат 		= Результат + СимволПроверки;

		ИначеЕсли ЭтоЛатиница Тогда

			ОбработатьСимволЕслиЭтоЛатиница(Результат, СимволПроверки);

		ИначеЕсли Не ЭтоБуква Тогда

			ОбработатьСимволЕслиЭтоНеБуква(Результат, СимволПроверки, КодСимвола);

		Иначе
			Продолжить;
		КонецЕсли;

	КонецЦикла;

	ЗаменитьДваПробелаНаОдин(Результат);

	Возврат Результат;

КонецФункции

Процедура ОбработатьСимволЕслиЭтоЛатиница(Результат, СимволПроверки)

	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("A", СимволПроверки, "А");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("B", СимволПроверки, "В");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("C", СимволПроверки, "С");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("E", СимволПроверки, "Е");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("H", СимволПроверки, "Н");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("M", СимволПроверки, "М");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("O", СимволПроверки, "О");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("P", СимволПроверки, "Р");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("T", СимволПроверки, "Т");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("X", СимволПроверки, "Х");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("I", СимволПроверки, "І");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("Y", СимволПроверки, "У");

	Результат 		= Результат + СимволПроверки;

КонецПроцедуры

Процедура ОбработатьСимволЕслиЭтоНеБуква(Результат, СимволПроверки, КодСимвола)

	ЭтоПробелИлиТире = КодСимвола = КодСимвола("-") Или КодСимвола = КодСимвола(" ");
	ЭтоДругиеСимволы =
		КодСимвола = КодСимвола(".")
		Или КодСимвола = КодСимвола(",")
		Или КодСимвола = КодСимвола("/")
		Или КодСимвола = КодСимвола(":")
		Или КодСимвола = КодСимвола("\")
		Или КодСимвола = КодСимвола("*")
		Или КодСимвола = КодСимвола(";");

	Если ЭтоПробелИлиТире Тогда

		Результат = Результат + СимволПроверки;

	КонецЕсли;

	Если ЭтоДругиеСимволы Тогда

		Результат = Результат + ", ";

	КонецЕсли;

КонецПроцедуры

Процедура ЗаменитьДваПробелаНаОдин(Результат)

	Пока СтрНайти(Результат, "  ") > 0 Цикл
		Результат = СтрЗаменить(Результат, "  ", " ");
	КонецЦикла;

КонецПроцедуры

Функция ПоискТранспортныеСредстваПоНомерам(РазныеВариантыНомера)

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоискТранспортныеСредстваПоНомерам();
	Запрос.УстановитьПараметр("НомерЛатиница", 		РазныеВариантыНомера.НомерЛатиница);
	Запрос.УстановитьПараметр("НомерЛатиницаRUS", 	РазныеВариантыНомера.НомерЛатиницаRUS);
	Запрос.УстановитьПараметр("НомерКирилица", 		РазныеВариантыНомера.НомерКирилица);
	Запрос.УстановитьПараметр("НомерКирилицаRUS", 	РазныеВариантыНомера.НомерКирилицаRUS);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.ТранспортноеСредство;

КонецФункции

Функция ТекстЗапросаПоискТранспортныеСредстваПоНомерам()

	Возврат
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаТС.Ссылка КАК ТранспортноеСредство
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК ТаблицаТС
	|ГДЕ
	|	ТаблицаТС.НомерТранспортногоСредства = &НомерЛатиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаТС.Ссылка
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК ТаблицаТС
	|ГДЕ
	|	ТаблицаТС.НомерТранспортногоСредства = &НомерЛатиницаRUS
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаТС.Ссылка
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК ТаблицаТС
	|ГДЕ
	|	ТаблицаТС.НомерТранспортногоСредства = &НомерКирилица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаТС.Ссылка
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК ТаблицаТС
	|ГДЕ
	|	ТаблицаТС.НомерТранспортногоСредства = &НомерКирилицаRUS";

КонецФункции

Функция ЗначениеВJSON(Значение)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Функция JSONВЗначение(Строка, ИменаСвойствСоЗначениямиДата = Неопределено)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);

	Результат = ПрочитатьJSON(ЧтениеJSON, Ложь, ИменаСвойствСоЗначениямиДата);
	ЧтениеJSON.Закрыть();

	Возврат Результат;

КонецФункции

// Возвращает локализованное имя события журнала регистрации для интеграции.
//
// Параметры:
//   СобытиеВторогоУровня - Строка - имя события, добавляемое через точку к имени события по умолчанию.
//
// Возвращаемое значение:
//   Строка - Интеграция с Warehouse
//        или Интеграция с Warehouse.<ИмяСобытияВторогоУровня>.
//
Функция ИмяСобытияЖурналаРегистрации(СобытиеВторогоУровня = "")

	Если СобытиеВторогоУровня = "" Тогда
		Возврат НСтр("ru = 'Интеграция с Warehouse'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	Иначе
		Возврат СтрШаблон("%1.%2",
			НСтр("ru = 'Интеграция с Warehouse'",
				ОбщегоНазначения.КодОсновногоЯзыка()), СобытиеВторогоУровня);
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецОбласти
